Revit 2024 API
ImportIFCOptions Methods
The ImportIFCOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetImportIFCOptions
 Returns the current Revit instance's ImportIFCOptions.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace